IdeaRS.Connections
ConnectionType Enumeration
Compatible with IDEA StatiCa 0.0
 Represents a type of connection of two parts.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ConnectionType
Members
Member name | Value | Description
Bolted | 0 |  Parts are connected by bolts.
Welded | 1 |  Parts are connected by welds.
NotConnected | 2 |  Plates are not connected
See Also
Reference
IdeaRS.Connections.Data Namespace